#@ # 
#@ # Running icc2_shell Version P-2019.03-SP5 for linux64 -- Jun 30, 2020
#@ # Date:   Mon Sep  9 18:41:02 2024
#@ # Run by: teohchee@pglkvm06
#@ 

gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal2} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal10} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal2} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal4} -quiet]
open_lib /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB -edit
open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/route_opt.design
gui_set_pref_value -category {showRelativeLocationConstraints} -key {macroOffsetX} -value {0.001}
gui_set_pref_value -category {showRelativeLocationConstraints} -key {macroOffsetY} -value {0.001}
link_block
open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/route_opt.design
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-82}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge topology_repeater core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {cell_array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-82}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge topology_repeater edit_group shape via placement_blockage }
gui_show_map -window [gui_get_current_window -types Layout -mru] -map {globalCongestionMap} -show {true}
gui_set_map_option -map {globalCongestionMap} -option {rule_level} -value {hard}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4 M5 M6}
gui_write_window_image -file {./route} -window BlockWindow.1
open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/init_design.design
link_block
gui_show_map -window [gui_get_current_window -types Layout -mru] -map {globalCongestionMap} -show {true}
gui_write_window_image -file {./init} -window BlockWindow.2
open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/pg_design.design
link_block
win_select_objects -slct_targets global -at {1.959 0.958} -radius 0.0034
gui_write_window_image -file {./pg} -window BlockWindow.3
open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/floorplan.design
link_block
win_select_objects -within {{-138.804 0.958} {1.959 75.194}} -slct_targets global -slct_targets_operation clear
change_selection 
gui_write_window_image -file {./floorplan} -window BlockWindow.4
open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/place_opt.design
win_select_objects -slct_targets global -at {375.073 292.385} -radius 0.6615
link_block
gui_write_window_image -file {./place} -window BlockWindow.5
open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/clock_opt.design
link_block
gui_write_window_image -file {./cts} -window BlockWindow.6
set_working_design_stack MYLIB:MYTOP/place_opt.design
set_working_design_stack MYLIB:MYTOP/floorplan.design
set_working_design_stack MYLIB:MYTOP/place_opt.design
set_working_design_stack MYLIB:MYTOP/clock_opt.design
set_working_design_stack MYLIB:MYTOP/pg_design.design
set_working_design_stack MYLIB:MYTOP/init_design.design
set_working_design_stack MYLIB:MYTOP/route_opt.design
start_gui
win_select_objects -within {{-98.495 223.107} {149.235 310.409}} -slct_targets global -slct_targets_operation clear
gui_zoom -window [gui_get_current_window -view] -rect {{-70.886 283.547} {-64.171 272.354}}
gui_zoom -window [gui_get_current_window -view] -full
change_selection 
gui_zoom -window [gui_get_current_window -view] -rect {{-74.617 145.504} {229.822 -5.969}}
quit
