
Loading user preference file /nfs/png/home/teohchee/.synopsys_icc2_gui/preferences.tcl
Load ICV ICCII menu file: /nfs/png/disks/MDC_Elite/cad/icv/P-2019.06-SP2-11/etc/tcl-u/Icc2Menu.tcl
 + VUE INFO: Please click View->IC Validator VUE in LayoutWindow menu
            to launch VUE.

 + VUE ERROR: couldn't open socket: address already in use

 + VUE ERROR: couldn't open socket: address already in use

 + VUE INFO: Found a usable port: 2448

Loading user favorites file /nfs/png/home/teohchee/.synopsys_icc2_gui/favorites.tcl
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal2} -quiet]
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal10} -quiet]
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal2} -quiet]
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal4} -quiet]
icc2_shell> open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/route_opt.design
Opening block 'MYLIB:MYTOP/route_opt.design' in edit mode
Information: loading PG routing via master rules, patterns, strategies and strategy via rules.
icc2_shell> link_block
Warning: Library MYLIB reference library 'saed32lvt_c.ndm' is not bound. (LNK-062)
Using libraries: MYLIB
Visiting block MYLIB:MYTOP/route_opt.design
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NAND2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NOR2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:OAI21X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:XOR2X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:MUX21X1_LVT'. (LNK-081)
Information: Message limit (link.reference_limit 12) reached for this block, remaining reference messages will be suppressed. (LNK-043)
Information: Block 'MYLIB:MYTOP/route_opt.design' has 64 unresolved references. (LNK-074)
Design 'MYTOP' was successfully linked.
0
icc2_shell> open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/route_opt.design
Information: Incrementing open_count of block 'MYLIB:MYTOP/route_opt.design' to 2. (DES-021)
{MYLIB:MYTOP/route_opt.design}
icc2_shell> open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/init_design.design
Opening block 'MYLIB:MYTOP/init_design.design' in edit mode
icc2_shell> link_block
Warning: Library MYLIB reference library 'saed32lvt_c.ndm' is not bound. (LNK-062)
Using libraries: MYLIB
Visiting block MYLIB:MYTOP/init_design.design
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NAND2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NOR2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:OAI21X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:XOR2X1_LVT'. (LNK-081)
Information: Message limit (link.reference_limit 12) reached for this block, remaining reference messages will be suppressed. (LNK-043)
Information: Block 'MYLIB:MYTOP/init_design.design' has 33 unresolved references. (LNK-074)
Design 'MYTOP' was successfully linked.
0
icc2_shell> open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/pg_design.design
Opening block 'MYLIB:MYTOP/pg_design.design' in edit mode
icc2_shell> link_block
Warning: Library MYLIB reference library 'saed32lvt_c.ndm' is not bound. (LNK-062)
Using libraries: MYLIB
Visiting block MYLIB:MYTOP/pg_design.design
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NAND2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NOR2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:OAI21X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:XOR2X1_LVT'. (LNK-081)
Information: Message limit (link.reference_limit 12) reached for this block, remaining reference messages will be suppressed. (LNK-043)
Information: Block 'MYLIB:MYTOP/pg_design.design' has 33 unresolved references. (LNK-074)
Design 'MYTOP' was successfully linked.
0
icc2_shell> open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/floorplan.design
Opening block 'MYLIB:MYTOP/floorplan.design' in edit mode
Information: loading PG routing via master rules, patterns, strategies and strategy via rules.
icc2_shell> link_block
Warning: Library MYLIB reference library 'saed32lvt_c.ndm' is not bound. (LNK-062)
Using libraries: MYLIB
Visiting block MYLIB:MYTOP/floorplan.design
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NAND2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NOR2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:OAI21X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:XOR2X1_LVT'. (LNK-081)
Information: Message limit (link.reference_limit 12) reached for this block, remaining reference messages will be suppressed. (LNK-043)
Information: Block 'MYLIB:MYTOP/floorplan.design' has 33 unresolved references. (LNK-074)
Design 'MYTOP' was successfully linked.
0
icc2_shell> open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/place_opt.design
Opening block 'MYLIB:MYTOP/place_opt.design' in edit mode
Information: loading PG routing via master rules, patterns, strategies and strategy via rules.
icc2_shell> link_block
Warning: Library MYLIB reference library 'saed32lvt_c.ndm' is not bound. (LNK-062)
Using libraries: MYLIB
Visiting block MYLIB:MYTOP/place_opt.design
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NAND2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NOR2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:OAI21X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:XOR2X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:MUX21X1_LVT'. (LNK-081)
Information: Message limit (link.reference_limit 12) reached for this block, remaining reference messages will be suppressed. (LNK-043)
Information: Block 'MYLIB:MYTOP/place_opt.design' has 56 unresolved references. (LNK-074)
Information: Clearing abstracted power annotation ... 
Design 'MYTOP' was successfully linked.
0
icc2_shell> open_block /nfs/png/disks/MDC_Elite/2024/teohchee/Synopsys_Lab/assignment/icc2/MYLIB:MYTOP/clock_opt.design
Opening block 'MYLIB:MYTOP/clock_opt.design' in edit mode
Information: loading PG routing via master rules, patterns, strategies and strategy via rules.
icc2_shell> link_block
Warning: Library MYLIB reference library 'saed32lvt_c.ndm' is not bound. (LNK-062)
Using libraries: MYLIB
Visiting block MYLIB:MYTOP/clock_opt.design
Error: Unable to resolve reference to 'saed32lvt_c:DFFARX1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX8_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX2_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NBUFFX4_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:INVX0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NAND2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:NOR2X0_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:OAI21X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:XOR2X1_LVT'. (LNK-081)
Error: Unable to resolve reference to 'saed32lvt_c:MUX21X1_LVT'. (LNK-081)
Information: Message limit (link.reference_limit 12) reached for this block, remaining reference messages will be suppressed. (LNK-043)
Information: Block 'MYLIB:MYTOP/clock_opt.design' has 60 unresolved references. (LNK-074)
Information: Clearing abstracted power annotation ... 
Design 'MYTOP' was successfully linked.
0
icc2_shell> set_working_design_stack MYLIB:MYTOP/place_opt.design
icc2_shell> set_working_design_stack MYLIB:MYTOP/floorplan.design
icc2_shell> set_working_design_stack MYLIB:MYTOP/place_opt.design
icc2_shell> set_working_design_stack MYLIB:MYTOP/clock_opt.design
icc2_shell> set_working_design_stack MYLIB:MYTOP/pg_design.design
icc2_shell> set_working_design_stack MYLIB:MYTOP/init_design.design
icc2_shell> set_working_design_stack MYLIB:MYTOP/route_opt.design
icc2_shell> start_gui
Load ICV ICCII menu file: /nfs/png/disks/MDC_Elite/cad/icv/P-2019.06-SP2-11/etc/tcl-u/Icc2Menu.tcl
 + VUE INFO: Found a usable port: 2448

icc2_shell> quit
Maximum memory usage for this session: 885.12 MB
Maximum memory usage for this session including child processes: 885.12 MB
CPU usage for this session:    976 seconds (  0.27 hours)
Elapsed time for this session:  67123 seconds ( 18.65 hours)
Thank you for using IC Compiler II.

